""" 2015년 시즌 자료를 수정 보완하는 라이브러리

본 파일에는 이미 추가하고자 하는 자료를 상수 형식으로 저장하고 있다.
이것을 가지고 `fix`에 들어 있는 코드를 가지고 이미 수집한 자료를 수정하고 보완한다.
다음을 수정한다.

- 7월 8일 기아과 넥센 경기(20150708,HTWO0)는 전체 자료가 없습니다.

아래 코드를 실행하면 수집한 2015년 7월 자료 파일인 `2015_07.json`을 읽고 
이 게임 목록 마지막 위 7월 8일 기아과 넥센 경기를 추가해 넣는다. 
그래서 경기 숫자가 100개에서 101개로 증가하는 것을 볼 수 있다.

Examples:

```python
    >>> import fix
    >>> location = "../sample_data"
    >>> fix.fix_season_2015.game_data(location)
    ../sample_data
    100
    home_batter 20150708_HTWO0
    dict_keys(['home_batter'])
    away_batter 20150708_HTWO0
    dict_keys(['home_batter', 'away_batter'])
    home_pitcher 20150708_HTWO0
    dict_keys(['home_batter', 'away_batter', 'home_pitcher'])
    away_pitcher 20150708_HTWO0
    dict_keys(['home_batter', 'away_batter', 'home_pitcher', 'away_pitcher'])
    101
    patch complete!
```

"""

import json
import configparser

import fix

config = configparser.ConfigParser()
config.read("kbo_data.ini", encoding="utf-8")
kbo_data_seasons = config["seasons"]
kbo_data_seasons_list = [item for item in kbo_data_seasons]


scoreboard_20150708_HTWO0 = {
    "scoreboard": [
        {
            "팀": "KIA",
            "승패": "패",
            "1": 0,
            "2": 0,
            "3": 1,
            "4": 0,
            "5": 2,
            "6": 0,
            "7": 0,
            "8": 0,
            "9": 0,
            "10": 0,
            "11": 0,
            "12": 0,
            "R": 3,
            "H": 7,
            "E": 0,
            "B": 2,
        },
        {
            "팀": "넥센",
            "승패": "승",
            "1": 0,
            "2": 0,
            "3": 0,
            "4": 2,
            "5": 0,
            "6": 0,
            "7": 0,
            "8": 1,
            "9": 0,
            "10": 0,
            "11": 0,
            "12": 1,
            "R": 4,
            "H": 15,
            "E": 1,
            "B": 7,
        },
    ]
}
ETC_info_20150708_HTWO0 = {
    "ETC_info": {
        "홈런": "이홍구5호6호",
        "2루타": [
            "김민우(3회)",
            "고종욱(3회)",
            "박헌도(4회)",
            "김민성(4회)",
            "스나이더(5회)",
            "유한준2(8 10회)",
            "서건창(9회)",
        ],
        "실책": "유재신(10회)",
        "도루": ["신종길(1회)", "유재신2(8 11회)"],
        "도루자": "백용환(2회)",
        "주루사": "유한준(8회)",
        "병살타": "김다원(2회)",
        "폭투": ["박정수(4회)", "한승혁(7회)"],
        "보크": "박정수(3회)",
        "심판": ["김정국", "문승훈", "박종철", "김성철"],
        "구장": "목동",
        "관중": "6,875",
        "개시": "18:30",
        "종료": "23:01",
        "경기시간": "4:31",
    }
}

home_batters_20150708_HTWO0 = """
타자명,포지션, 타수,득점,안타,타점,홈런,볼넷,삼진,타율,1,2,3,4,5,6,7,8,9,10,11,12
고종욱,좌익수,5,0,3,1,0,1,0,0.317,좌비,,좌2,,좌비,,투안,좌안,,고4,,투희번
서건창,2루수,2,0,1,0,0,2,0,0.273,4구,,유땅,,4구,,포희번,,3좌2,,,
김민준,대타,0,0,0,0,0,0,0,0.000,,,,,,,,,,,,
김지수,대타,1,0,0,0,0,0,0,0.256,,,,,,,,,,우비,,
스나이더,중견·우익,4,1,2,0,0,1,1,0.256,삼진,,,중안,우2,,4구,,3희번,2땅,,
박병호,지명타자,5,0,0,0,0,1,4,0.340,삼진,,,2비,삼진,,삼진,,고4,,삼진,
김민성,3루수,5,1,2,0,0,1,0,0.318,,중비,,중2,,우중안,우비,,고4,,포파,
윤석민,1루수,3,0,2,1,0,0,1,0.308,,삼진,,우희비,,좌안,,중안,,,,
유재신,대타,2,1,1,0,0,0,1,0.313,,,,,,,,,삼진,,중안,
박헌도,우익수,4,0,1,0,0,0,1,0.245,,삼진,,좌2,,좌비,,3땅,,,,
김재현,대타,2,0,0,0,0,0,1,0.194,,,,,,,,,3땅,,삼진,
김하성,유격수,5,1,0,0,0,1,2,0.282,,,삼진,투땅,,3파,,중비,,삼진,,4구
박동원,포수,3,0,0,0,0,0,1,0.243,,,좌비,,삼진,포파,,,,,,
유한준,대타,3,0,3,1,0,0,0,0.363,,,,,,,,좌2,,좌중2,,유안
"""

home_batters_patch_20150708_HTWO0 = {
    "id": "20150708_HTWO0",
    "fixed_file_name": "2015_07.json",
    "팀": "넥센",
    "home_or_away": "home_batter",
}

home_pitchers_20150708_HTWO0 = """
투수명,이닝,피안타,실점,자책,4사구,삼진,피홈런,타자,타수,투구수,경기,승리,패전,세이브,평균자책
피어밴드,7,6,3,3,1,8,2,26,24,105,17,6,7,0,4.22
김영민,1,0,0,0,1,1,0,4,3,20,43,2,4,0,5.72
조상우,2 ⅔,0,0,0,0,1,0,8,8,24,41,5,3,0,1.98
손승락,1 ⅓,1,0,0,0,1,0,5,5,16,33,3,3,15,2.43
"""

home_pitchers_patch_20150708_HTWO0 = {
    "id": "20150708_HTWO0",
    "손승락": {"결과": "승"},
    "팀": "넥센",
    "home_or_away": "home_pitcher",
}

away_batters_20150708_HTWO0 = """
타자명,포지션,타수,득점,안타,타점,홈런,볼넷,삼진,타율,1,2,3,4,5,6,7,8,9,10,11,12
신종길,우익수,4,0,1,0,0,0,1,0.287,유안,,2땅,,삼진,,,2땅,,,,
고영우,대타,1,0,0,0,0,0,0,0.000,,,,,,,,,,,유땅,
김민우,유격·2루,4,0,1,0,0,0,2,0.330,투희번,,우2,,삼진,,,삼진,,,3땅,
김주형,1루수,3,0,0,0,0,0,1,0.314,삼진,,포파,,,우비,,,,,,
강한울,대타,0,0,0,0,0,0,0,0.216,,,,,,,,,,,,
김주찬,대타,1,0,0,0,0,0,0,0.345,,,,,,,,중비,,,,
최용규,대타,1,0,0,0,0,0,0,0.227,,,,,,,,,,,2비,
필,2루·1루,5,0,0,0,0,0,1,0.315,삼진,,,유땅,,좌비,,,3직,,,2땅
이범호,3루수,4,0,1,0,0,1,0,0.232,,4구,,좌비,,중비,,,3비,,,우안
김다원,좌익수,3,0,0,0,0,0,2,0.256,,유2병,,삼진,,,삼진,,,,,
이호신,대타,2,0,0,0,0,0,0,0.129,,,,,,,,,좌비,,,2땅
백용환,포수,3,1,2,0,0,0,1,0.385,,좌안,,,우안,,삼진,,,,,
차일목,대타,1,0,0,0,0,0,1,0.174,,,,,,,,,,삼진,,
김광수,대타,0,0,0,0,0,0,0,0.000,,,,,,,,,,,,
스틴슨,대타,1,0,0,0,0,0,1,0.000,,,,,,,,,,,,삼진
이홍구,지명·포수,4,2,2,3,2,0,1,0.252,,,좌중홈,,좌홈,,삼진,,,3땅,,
김호령,중견수,3,0,0,0,0,1,0,0.237,,,3파,,1땅,,,4구,,1파,,
"""

away_batters_patch_20150708_HTWO0 = {
    "id": "20150708_HTWO0",
    "fixed_file_name": "2015_07.json",
    "팀": "KIA",
    "home_or_away": "away_batter",
}

away_pitchers_20150708_HTWO0 = """
투수명,이닝,피안타,실점,자책,4사구,삼진,피홈런,타자,타수,투구수,경기,승리,패전,세이브,평균자책
박정수,5,5,2,2,2,7,0,22,19,95,3,0,0,0,3.46
최영필,1,2,0,0,0,0,0,5,5,18,34,3,1,0,3.50
김태영,0 ⅓,1,0,0,0,0,0,2,1,7,24,0,2,0,3.09
한승혁,1,1,1,1,1,1,0,5,4,27,23,1,4,0,5.25
윤석민,1 ⅔,3,0,0,2,1,0,9,6,37,29,1,4,17,3.32
김광수,2,2,0,0,1,3,0,9,8,37,8,0,0,0,2.79
스틴슨,0 ⅓,1,1,1,1,0,0,3,1,11,18,8,6,0,4.26
"""

away_pitchers_patch_20150708_HTWO0 = {
    "id": "20150708_HTWO0",
    "최영필": {"결과": "홀드"},
    "김태영": {"결과": "홀드"},
    "스틴슨": {"결과": "패"},
    "팀": "KIA",
    "home_or_away": "away_pitcher",
}

total_fix_list = [
    (home_batters_20150708_HTWO0, home_batters_patch_20150708_HTWO0),
    (away_batters_20150708_HTWO0, away_batters_patch_20150708_HTWO0),
    (home_pitchers_20150708_HTWO0, home_pitchers_patch_20150708_HTWO0),
    (away_pitchers_20150708_HTWO0, away_pitchers_patch_20150708_HTWO0),
]


def game_data(location):
    """20150708_HTWO 게임 데이터에서 빠진 부분을 가지고 있는 타자 자료를 가지고 채워 넣는 함수

    Args:
        location (str) : 우리가 수집한 자료 파일이 들어 있는 위치
    """

    print(location)
    single_game_data = {"id": "", "contents": ""}
    game_id = "20150708_HTWO0"
    temp_file_location = location + "/2015/2015_07.json"
    # print(temp_file_location)
    with open(temp_file_location, "r") as json_file:
        games = json.load(json_file)

    print(f"수정 전 경기 숫자: {len(games)}")
    is_game_id_exist = False

    for game in games:
        if game["id"] == game_id:
            print(game["id"]["contents"])
            is_game_id_exist = True
        else:
            is_game_id_exist = False

    if is_game_id_exist == False:
        temp_game_data = fix.both_batters_and_pitchers_data(total_fix_list)
        temp_game_data.update(scoreboard_20150708_HTWO0)
        temp_game_data.update(ETC_info_20150708_HTWO0)
        single_game_data["contents"] = temp_game_data
        single_game_data["id"] = game_id
    else:
        print("오류!")

    games.append(single_game_data)
    print(f"수정 후 경기 숫자: {len(games)}")

    try:
        with open(temp_file_location, "w") as outfile:
            json.dump(games, outfile, ensure_ascii=False)
            print("patch complete!")
    except Exception as e:
        print(e)
